var questions = [
    // 1
    {
        "question":"現在想揮霍在什麼事物種類上？",
        "answers":[
            ["金錢",2],
            ["人生",7],
            ["今天很省","A"]
        ]
    },
    // 2
    {
        "question":"是在煩惱食物 還是 想買東西呢？",
        "answers":[
            ["食物",3],
            ["想買東西",4],
            ["還是算了, 不買了","A"]
        ]
    },
    // 3
    {
        "question":"想加點 還是 不知道該不該花這麼多錢吃這家？",
        "answers":[
            ["加點","B"],
            ["不知道該不該花","C"],
            ["還是算了, 省點錢","A"]
        ]
    },
    // 4
    {
        "question":"是想課金 還是 其他的？",
        "answers":[
            ["課金","D"],
            ["其他",5],
            ["還是算了, 省點錢","A"]
        ]
    },
    // 5
    {
        "question":"買遊戲 還是 硬體？",
        "answers":[
            ["遊戲","E"],
            ["硬體",6],
            ["還是要玩盜版就好呢","F"]
        ]
    },
    // 6
    {
        "question":"2000多的電腦周邊硬體 還是 7000, 8000的？",
        "answers":[
            ["便宜一點好了 不要那麼誇張","G"],
            ["還是要買到更好","H"],
            ["算了啦 幾百塊雜牌就好","A"]
        ]
    },
    // 7
    {
        "question":"不想讀書做作業 還是 不想作正事？",
        "answers":[
            ["讀書作業","I"],
            ["正事","J"],
            ["還是打起精神開工好了","A"]
        ]
    }
];

var finalAnswers={
        "A":["別忍了, 大家都知道你不是這種人","該花就花, 想玩就玩, 別讓世俗限制了你的人生, 被當了下學期再來就好, 沒錢了吃泡麵就好 ^_^"],
        "B":["該點就點, 不要吝嗇","你想想看, 你現在不多點, 到時候半夜又餓了, 又要再花60,70去買消夜, 這樣不是更不好嗎？ 該吃的時候就該吃！"],
        "C":["想吃的話就吃, 別自我限制自己","就算你今天不吃, 你明天或是後天還不是會吃, 而且還會因為這樣的自我限制弄得整天不舒服, 這樣不是本末倒置了嗎？"],
        "D":["課金絕對不能省, 沒抽到沒關係, 下一單會更好","有人曾說過: 課金就和吃飯一樣, 課金的東西會在遊戲停運後消失, 好吃的東西也會在吃完後消失, 這樣一想還是課金比較有用！"],
        "E":["遊戲想玩就應該支持正版買下去！","所謂先買先享受, 尤其是劇情類型的遊戲, 晚點玩的話說不定就會在逛youtube的時候被爆雷。而且一定要支持正版, 支持這些遊戲製作商。"],
        "F":["身為現代公民 居然還敢支持盜版遊戲運行阿？","人家嘔心瀝血的作品, 被不肖商人copy就算了, 居然還想支持這些抄人作品的廠商活下去？我就是在說你啦騰訊！"],
        "G":["一分錢一分貨, 不要省","省了那點錢, 反而之後在使用上會覺得不夠好, 甚至是覺得當初買錯了, 所以要買就買好的, 不要之後再後悔。"],
        "H":["這樣就對了 買下去！","一分錢一分貨, 之後使用才不會後悔當初, 花了錢卻還沒得到理想上的體驗。"],
        "I":["那就不要讀阿","這麼簡單的事, 不想讀就不要讀嘛, 反正考試前再讀就好了, 作業也還有時限可以做啊, 要放就放, 不要在那邊提心吊膽。"],
        "J":["能拖則拖就是我的信念","這麼早做根本沒動力, 我就是不見棺材不掉淚, 不到deadline不會做。"],
};